back/app/controllers/api/v1/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY `users`.`created_at` DESC
INSERT INTO `users` (`content1`, `content2`, `content3`, `content4`, `created_at`, `updated_at`) VALUES ('hokaben', NULL, NULL, NULL, '2023-02-21 06:07:40.832794', '2023-02-21 06:07:40.832794')
---
      def index
        users = User.order(created_at: :desc)
        users_array = users.map do |user|
          {
            id: user.id,
            content1: user.content1,
            content2: user.content2,
            content3: user.content3,
            content4: user.content4,
            created_at: user.created_at

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
      def show
        render json: { message: '成功しました', data: @user = User.find(params[:id]) }, status: 200

INSERT INTO `users` (`content1`, `content2`, `content3`, `content4`, `created_at`, `updated_at`) VALUES ('happy', 'new', 'hoge', 'tom', '2023-02-10 00:05:52.243989', '2023-02-10 00:05:52.243989')
---
      def create
        users = User.new(content1: params[:content1], content2: params[:content2], content3: params[:content3], content4: params[:content4])
        if users.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 90
---
      def destroy
        users = User.find(params[:id])
        if users.destroy