back/app/controllers/api/v1/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY `users`.`created_at` DESC
---
      def sort_users
        User.order(created_at: :desc)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 186 LIMIT 1
---
      def find_user
        User.find(params[:id])